import React from "react";
import "./MyFuture.css";

const MyFuture = () => {
  return (
    <div className="my-future">
      <h1>Мій розвиток у світі IT</h1>

      <p>
      Для початку мені потрібно закінчити навчання за спеціальністю "Комп'ютерні науки" з відмінними результатами. Крім того, для підвищення кваліфікації я планую пройти курси в тій сфері, в якій хочу працювати в майбутньому.
      </p>

      <h2>Професія мрії</h2>
      <p>
      Я ще не визначився, у якій саме IT-сфері хочу працювати, але наразі найбільше хочу спробувати себе як тестувальник QA. Проте я вже знаю, які кроки потрібно зробити для цього.
      </p>

      <h2>Мої 3 кроки до успіху:</h2>
      <ol>
        <li>Завершити навчання з високими результатами та здобути сертифікати з тестування.</li>
        <li>Пройти стажування або знайти першу роботу в IT-компанії.</li>
        <li>Поглиблювати знання в автоматизованому тестуванні, інструментах типу Selenium, Postman, Jira.</li>
      </ol>

      <h2>Мій план розвитку</h2>
      <ul className="timeline">
        <li>
          <strong>2025</strong> – Оволодіти базовими знаннями для тестувальника QA..
        </li>
        <li>
          <strong>2025</strong> – Пройти стажування або отримати першу роботу як тестувальник QA.
        </li>
        <li>
          <strong>2026+</strong> – Покращувати свої навички та розпочати підйом по кар'єрним сходам.
        </li>
      </ul>
    </div>
  );
};

export default MyFuture;
